# @package    MikroTik / RouterOS / GRE
# @author     Kai Kimera <mail@kai.kim>
# @copyright  2024 Library Online
# @license    MIT
# @version    0.1.0
# @link
# -------------------------------------------------------------------------------------------------------------------- #

# -------------------------------------------------------------------------------------------------------------------- #
# Общие настройки.
# -------------------------------------------------------------------------------------------------------------------- #

# Секретная фраза IPsec.
:local ipsSecret "PassWord"

# -------------------------------------------------------------------------------------------------------------------- #
# Локальный маршрутизатор.
# -------------------------------------------------------------------------------------------------------------------- #

# Внешний IP-адрес локального маршрутизатора в интернете.
:local greLocalAddress "1.1.1.1"

# Название интерфейса GRE локального маршрутизатора.
:local greName "gre-gw1-gw2"

# IP-адрес интерфейса GRE локального маршрутизатора.
:local greIpAddress "10.255.255.1/24"

# Адрес сети GRE локального маршрутизатора.
:local greIpNetwork "10.255.255.0"

# -------------------------------------------------------------------------------------------------------------------- #
# Удалённый маршрутизатор.
# -------------------------------------------------------------------------------------------------------------------- #

# Внешний IP-адрес удалённого маршрутизатора в интернете.
:local greRemoteAddress "2.2.2.2"

# Название домена удалённого маршрутизатора.
:local greHost "gw2.example.com"

# Адрес сети удалённого маршрутизатора.
:local greIpRouteDstAddress "10.2.0.0/16"

# IP-адрес интерфейса GRE удалённого маршрутизатора.
:local greIpRouteGateway "10.255.255.2"

# -------------------------------------------------------------------------------------------------------------------- #

/interface gre add allow-fast-path=no ipsec-secret="$ipsSecret" name="$greName" \
  local-address=$greLocalAddress remote-address=$greRemoteAddress \
  comment="HOST: $greHost"

/ip address add address=$greIpAddress interface="$greName" network=$greIpNetwork \
  comment="[GRE] $greName"

/ip route add distance=1 dst-address=$greIpRouteDstAddress gateway=$greIpRouteGateway \
  comment="[GRE] DOMAIN: $greHost"
